[
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:13",
    "Moses": "And Noah and his sons hearkened unto the Lord, and gave heed, and they were called the sons of God."
  },
  {
    "Source 1 Verse": "Genesis 6:1",
    "Genesis": "And it came to pass, when men began to multiply on the face of the earth, and daughters were born unto them,",
    "Source 2 Verse": "Moses 8:14a",
    "Moses": "And when these men began to multiply on the face of the earth, and daughters were born unto them, [...]"
  },
  {
    "Source 1 Verse": "Genesis 6:2",
    "Genesis": "That the sons of God saw the daughters of men that they were fair; and they took them wives of all which they chose.",
    "Source 2 Verse": "Moses 8:14b",
    "Moses": "[...] the sons of men saw that those daughters were fair, and they took them wives, even as they chose."
  },
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:15",
    "Moses": "And the Lord said unto Noah: The daughters of thy sons have sold themselves; for behold mine anger is kindled against the sons of men, for they will not hearken to my voice."
  },
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:16",
    "Moses": "And it came to pass that Noah prophesied, and taught the things of God, even as it was in the beginning."
  },
  {
    "Source 1 Verse": "Genesis 6:3",
    "Genesis": "And the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
    "Source 2 Verse": "Moses 8:17",
    "Moses": "And the Lord said unto Noah: My Spirit shall not always strive with man, for he shall know that all flesh shall die; yet his days shall be an hundred and twenty years; and if men do not repent, I will send in the floods upon them."
  },
  {
    "Source 1 Verse": "Genesis 6:4",
    "Genesis": "There were giants in the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they bare children to them, the same became mighty men which were of old, men of renown.",
    "Source 2 Verse": "Moses 8:18",
    "Moses": "And in those days there were giants on the earth, and they sought Noah to take away his life; but the Lord was with Noah, and the power of the Lord was upon him."
  },
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:19",
    "Moses": "And the Lord ordained Noah after his own order, and commanded him that he should go forth and declare his Gospel unto the children of men, even as it was given unto Enoch."
  },
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:20",
    "Moses": "And it came to pass that Noah called upon the children of men that they should repent; but they hearkened not unto his words;"
  },
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:21",
    "Moses": "And also, after that they had heard him, they came up before him, saying: Behold, we are the sons of God; have we not taken unto ourselves the daughters of men? And are we not eating and drinking, and marrying and giving in marriage? And our wives bear unto us children, and the same are mighty men, which are like unto men of old, men of great renown. And they hearkened not unto the words of Noah."
  },
  {
    "Source 1 Verse": "Genesis 6:5",
    "Genesis": "And God saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually.",
    "Source 2 Verse": "Moses 8:22",
    "Moses": "And God saw that the wickedness of men had become great in the earth; and every man was lifted up in the imagination of the thoughts of his heart, being only evil continually."
  },
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:23",
    "Moses": "And it came to pass that Noah continued his preaching unto the people, saying: Hearken, and give heed unto my words;"
  },
  {
    "Source 1 Verse": "",
    "Genesis": "<italic>[This version uses different verse boundaries than other versions.] </italic>",
    "Source 2 Verse": "Moses 8:24",
    "Moses": "Believe and repent of your sins and be baptized in the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost, that ye may have all things made manifest; and if ye do not this, the floods will come in upon you; nevertheless they hearkened not."
  },
  {
    "Source 1 Verse": "Genesis 6:6",
    "Genesis": "And it repented the Lord that he had made man on the earth, and it grieved him at his heart.",
    "Source 2 Verse": "Moses 8:25",
    "Moses": "And it repented Noah, and his heart was pained that the Lord had made man on the earth, and it grieved him at the heart."
  },
  {
    "Source 1 Verse": "Genesis 6:7",
    "Genesis": "And the Lord said, I will destroy man whom I have created from the face of the earth; both man, and beast, and the creeping thing, and the fowls of the air; for it repenteth me that I have made them.",
    "Source 2 Verse": "Moses 8:26",
    "Moses": "And the Lord said: I will destroy man whom I have created, from the face of the earth, both man and beast, and the creeping things, and the fowls of the air; for it repenteth Noah that I have created them, and that I have made them; and he hath called upon me; for they have sought his life."
  },
  {
    "Source 1 Verse": "Genesis 6:8",
    "Genesis": "But Noah found grace in the eyes of the Lord.",
    "Source 2 Verse": "Moses 8:27a",
    "Moses": "And thus Noah found grace in the eyes of the Lord; [...]"
  },
  {
    "Source 1 Verse": "Genesis 6:9",
    "Genesis": "These are the generations of Noah: Noah was a just man and perfect in his generations, and Noah walked with God.",
    "Source 2 Verse": "Moses 8:27b",
    "Moses": "[...] for Noah was a just man, and perfect in his generation; and he walked with God, [...]"
  },
  {
    "Source 1 Verse": "Genesis 6:10",
    "Genesis": "And Noah begat three sons, Shem, Ham, and Japheth.",
    "Source 2 Verse": "Moses 8:27c",
    "Moses": "[...] as did also his three sons, Shem, Ham, and Japheth."
  },
  {
    "Source 1 Verse": "Genesis 6:11",
    "Genesis": "The earth also was corrupt before God, and the earth was filled with violence.",
    "Source 2 Verse": "Moses 8:28",
    "Moses": "The earth was corrupt before God, and it was filled with violence."
  },
  {
    "Source 1 Verse": "Genesis 6:12",
    "Genesis": "And God looked upon the earth, and, behold, it was corrupt; for all flesh had corrupted his way upon the earth.",
    "Source 2 Verse": "Moses 8:29",
    "Moses": "And God looked upon the earth, and, behold, it was corrupt, for all flesh had corrupted its way upon the earth."
  },
  {
    "Source 1 Verse": "Genesis 6:13",
    "Genesis": "And God said unto Noah, The end of all flesh is come before me; for the earth is filled with violence through them; and, behold, I will destroy them with the earth.",
    "Source 2 Verse": "Moses 8:30",
    "Moses": "And God said unto Noah: The end of all flesh is come before me, for the earth is filled with violence, and behold I will destroy all flesh from off the earth."
  }
]